tests/Stubs/Customers/CreateWithIdentificationsRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:ns1="http://www.retaildirections.com/"><env:Header><ns1:SecurityToken><ns1:Username></ns1:Username><ns1:Password></ns1:Password><ns1:ServiceName>CustomerEdit</ns1:ServiceName><ns1:ServiceVersion>1</ns1:ServiceVersion></ns1:SecurityToken></env:Header><env:Body><ns1:RDService><ns1:request><CustomerEditRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.retaildirections.com/"><Customer><firstName>Dan</firstName><lastName>Greaves</lastName><emailAddress>dan@arkade.com.au</emailAddress><homeLocationCode>1004</homeLocationCode><origin>Google</origin></Customer><CustomerIdentifications><CustomerIdentification><customerIdentificationId>OMNEO</customerIdentificationId><customerReference>abc123</customerReference></CustomerIdentification></CustomerIdentifications></CustomerEditRequest></ns1:request></ns1:RDService></env:Body></env:Envelope>
