tests/Stubs/FullRequestEnvelope.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:ns1="http://www.retaildirections.com/"><env:Header><ns1:SecurityToken><ns1:Username>abc123</ns1:Username><ns1:Password>secret</ns1:Password><ns1:ServiceName>CustomerGet</ns1:ServiceName><ns1:ServiceVersion>1</ns1:ServiceVersion></ns1:SecurityToken></env:Header><env:Body><ns1:RDService><ns1:request><CustomerGetRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.retaildirections.com/"><CustomerGet><customerId>050101000005</customerId><requestDateTime>2017-07-25T06:45:55.448605+00:00</requestDateTime></CustomerGet></CustomerGetRequest></ns1:request></ns1:RDService></env:Body></env:Envelope>
